In [3]:
#Importing some modules
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import os

In [4]:
#Defining path and file to load
school_data_to_load=os.path.join("Resources","schools_complete.csv" )
student_data_to_load=os.path.join("Resources","students_complete.csv" )

In [7]:
# Read School and Student Data File and store into Pandas DataFrames
school_data = pd.read_csv(school_data_to_load)
student_data = pd.read_csv(student_data_to_load)

In [10]:
# looking the data first
school_data.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [11]:
# looking the data first
student_data.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [12]:
# Combine the data into a single dataset.  
school = (pd.merge(student_data, school_data, how="left", 
                                 on=["school_name", "school_name"]))

In [18]:
# looking the data first
school.tail()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
39165,39165,Donna Howard,F,12th,Thomas High School,99,90,14,Charter,1635,1043130
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70,14,Charter,1635,1043130
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84,14,Charter,1635,1043130
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90,14,Charter,1635,1043130
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75,14,Charter,1635,1043130

In [14]:
#looking for shape
school.shape
print(f'The number of rows is:{school.shape[0]} and number of columns is: {school.shape[1]}')

The number of rows is:39170 and number of columns is: 11

In [15]:
#looking for dtypes and null value
school.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 39170 entries, 0 to 39169
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Student ID     39170 non-null  int64
 1   student_name   39170 non-null  object
 2   gender         39170 non-null  object
 3   grade          39170 non-null  object
 4   school_name    39170 non-null  object
 5   reading_score  39170 non-null  int64
 6   math_score     39170 non-null  int64
 7   School ID      39170 non-null  int64
 8   type           39170 non-null  object
 9   size           39170 non-null  int64
 10  budget         39170 non-null  int64
dtypes: int64(6), object(5)
memory usage: 3.6+ MB

In [16]:
#Describing the dataframe
school.describe()

,Student ID,reading_score,math_score,School ID,size,budget
count,39170.000000,39170.00000,39170.000000,39170.000000,39170.000000,3.917000e+04
mean,19584.500000,81.87784,78.985371,6.978172,3332.957110,2.117241e+06
std,11307.549359,10.23958,12.309968,4.444329,1323.914069,8.749987e+05
min,0.000000,63.00000,55.000000,0.000000,427.000000,2.480870e+05
25%,9792.250000,73.00000,69.000000,3.000000,1858.000000,1.081356e+06
50%,19584.500000,82.00000,79.000000,7.000000,2949.000000,1.910635e+06
75%,29376.750000,91.00000,89.000000,11.000000,4635.000000,3.022020e+06
max,39169.000000,99.00000,99.000000,14.000000,4976.000000,3.124928e+06

In [17]:
#columns name
school.columns

Index(['Student ID', 'student_name', 'gender', 'grade', 'school_name',
       'reading_score', 'math_score', 'School ID', 'type', 'size', 'budget'],
      dtype='object')

In [40]:
school.value_counts('budget')

budget
3124928    4976
3094650    4761
3022020    4635
2547363    3999
1884411    2949
1910635    2917
1763916    2739
1319574    2283
1081356    1858
1049400    1800
1056600    1761
1043130    1635
917500     1468
585858      962
248087      427
dtype: int64

In [71]:
#District Summary
tot_school=school.school_name.nunique()
tot_student=school['Student ID'].count()
tot_budget=(school.groupby('school_name')['budget'].sum()
        /school.groupby('school_name')['budget'].count()).sum()
avg_math=school.math_score.mean()
avg_read=school.reading_score.mean()
perc_math=(school.loc[school.math_score >=70, 'Student ID'].count()/tot_student)*100
perc_read=(school.loc[school.reading_score >=70, 'Student ID'].count()/tot_student)*100
perc_both=((school.loc[(school.reading_score >=70) & (school.math_score >=70) ,'Student ID']
            .count()/tot_student)*100)
district_summary=pd.DataFrame({'Total Schools':[tot_school],
             'Total Students':[tot_student],
             'Total Budget':[tot_budget],
             'Average Math Score':[avg_math],
             'Average Reading Score':[avg_read],
             '% Passing Math':[perc_math],
             '% Passing Reading':[perc_read],          
             '% Overall Passing':[perc_both]})
district_summary['Total Budget']=district_summary['Total Budget'].map('${:,.2f}'.format)
district_summary

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,39170,"$24,649,428.00",78.985371,81.87784,74.980853,85.805463,65.172326

In [90]:
school.loc[school.math_score >=70, 'Student ID']

0            0
4            4
5            5
6            6
8            8
         ...
39165    39165
39166    39166
39167    39167
39168    39168
39169    39169
Name: Student ID, Length: 29370, dtype: int64

In [97]:
#School Summary
group=school.groupby('school_name')
total_students=group['Student ID'].count()
#school_type=group['type'].keys
total_budget=group['budget'].sum()/group['budget'].count()
per_stu_budget=total_budget/total_students
avg_math_score=group['math_score'].mean()
avg_read_score=group['reading_score'].mean()
#perc_math_score=group[school.loc[school.math_score >=70, 'Student ID']]
school_summary=pd.DataFrame(total_students)
school_summary['Total Budgets']=total_budget
school_summary['Per Student Budget']=per_stu_budget
school_summary['Average Math Score']=avg_math_score
school_summary['Average Reading Score']=avg_read_score
school_summary

,Student ID,Total Budgets,Per Student Budget,Average Math Score,Average Reading Score
school_name,,,,,
Bailey High School,4976,3124928.0,628.0,77.048432,81.033963
Cabrera High School,1858,1081356.0,582.0,83.061895,83.975780
Figueroa High School,2949,1884411.0,639.0,76.711767,81.158020
Ford High School,2739,1763916.0,644.0,77.102592,80.746258
Griffin High School,1468,917500.0,625.0,83.351499,83.816757
Hernandez High School,4635,3022020.0,652.0,77.289752,80.934412
Holden High School,427,248087.0,581.0,83.803279,83.814988
Huang High School,2917,1910635.0,655.0,76.629414,81.182722
Johnson High School,4761,3094650.0,650.0,77.072464,80.966394
Pena High School,962,585858.0,609.0,83.839917,84.044699
Rodriguez High School,3999,2547363.0,637.0,76.842711,80.744686
Shelton High School,1761,1056600.0,600.0,83.359455,83.725724
Thomas High School,1635,1043130.0,638.0,83.418349,83.848930
Wilson High School,2283,1319574.0,578.0,83.274201,83.989488
Wright High School,1800,1049400.0,583.0,83.682222,83.955000

In [ ]:
#Top Performing Schools (By % Overall Passing)

In [ ]:
#Bottom Performing Schools (By % Overall Passing)

In [ ]:
#Math Scores by Grade**

In [ ]:
#Reading Scores by Grade

In [ ]:
#Scores by School Spending

In [ ]:
#Scores by School Size

In [ ]:
#Scores by School Type